<h2 id='part2'>What are the busiest times of the year to visit Seattle? By how much do prices spike ?</h2>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In order to answer our question we will analyse the variables listing_id and date in the reviews dataset. and the variables listing id,  data and price in the calender dataset.

In [37]:
### load the nessesary data.
df_1 = pd.read_csv('reviews.csv', parse_dates=['date'])[['listing_id', 'date']] ### reserved date
df_2 = pd.read_csv('calendar.csv', parse_dates=['date'])[['listing_id', 'date', 'price']] ### price

In [38]:
df_1.head()

   listing_id       date
0     7202016 2015-07-19
1     7202016 2015-07-20
2     7202016 2015-07-26
3     7202016 2015-08-02
4     7202016 2015-08-10

In [39]:
df_2.head()

   listing_id       date   price
0      241032 2016-01-04  $85.00
1      241032 2016-01-05  $85.00
2      241032 2016-01-06     NaN
3      241032 2016-01-07     NaN
4      241032 2016-01-08     NaN

In [40]:
### data shape
print("df_1 shape : ", df_1.shape)
print("df_2 shape : ", df_2.shape)

df_1 shape :  (84849, 2)
df_2 shape :  (1393570, 3)

## What are the busiest times of the year to visit Seattle ?

Two answer this question we will analyse the frequency of reservation in the reviews dataset.

In [57]:
### get reviews frequency
res_freq = pd.DataFrame(df_1['date'].value_counts().values, index= df_1['date'].value_counts().index, columns=['rev_num'])
res_freq.head()

            rev_num
2015-09-21      580
2015-08-07      400
2015-09-07      384
2015-08-10      383
2015-08-31      371

In [58]:
#### reviews number per year
res_freq_year = res_freq.resample('A').sum()
res_freq_year

            rev_num
2009-12-31       17
2010-12-31      254
2011-12-31     1169
2012-12-31     3251
2013-12-31     7077
2014-12-31    20365
2015-12-31    52493
2016-12-31      223

From the table above we can see that the numbers of reservation is defferente from one year to anoth